// region.tsx

export type Place = {
  [key: string]: string[];
};

// city
export const city = [
  "فاقوس",
  "كفر صقر",
  "أبوكبير",
  "أبو حماد",
  "الحسينية",
  "الصالحية الجديدة",
];

//  area
export const area: Place = {
  فاقوس: ["بنك مصر", "كوبري الصحارة", "أبو شلبي"],
  "الصالحية الجديدة": ["الصالحية الجديدة"],
  "كفر صقر": ["كوبري السوق"],
  أبوكبير: ["مزلقان المحلج"],
  "أبو حماد": ["كوبرى المركز", "كوبري السعدية", "المعهد", "التل", "القصاصين"],
  الحسينية: ["كوبرى الموقف", "مفارق خضير"],
};

//  atimeing
export const atime: Place = {
  "بنك مصر": ["05:30 ص - المعاد الاول", "07:30 ص - المعاد الثانى"],
  "كوبري الصحارة": ["06:10 ص - المعاد الاول", "08:10 ص - المعاد الثانى"],
  "أبو شلبي": ["06:20 ص - المعاد الاول", "08:20 ص - المعاد الثانى"],
  "الصالحية الجديدة": ["06:50 ص - المعاد الاول", "08:50 ص - المعاد الثانى"],
  "كوبري السوق": ["05:00 ص - المعاد الاول", "07:00 ص - المعاد الثانى"],
  "مزلقان المحلج": ["05:15 ص - المعاد الاول", "07:15 ص - المعاد الثانى"],
  "كوبرى المركز": ["06:10 ص - المعاد الاول"],
  "كوبري السعدية": ["06:20 ص - المعاد الاول"],
  المعهد: ["06:30 ص - المعاد الاول"],
  التل: ["06:40 ص - المعاد الاول"],
 "كوبرى القصاصين": ["07:00 ص - المعاد الاول", "09:00 ص - المعاد الثانى"],
  "كوبرى الموقف": ["05:45 ص - المعاد الاول"],
  "مفارق خضير": ["06:45 ص - المعاد الاول", "08:45 ص - المعاد الثانى"],
};

// Typa of Trip
export const TypeOfTripSel = ["ذهاب", "عودة", "ذهاب وعودة"];

// Payment Type
export const PaymentSel = ["نقداً", "فودافون كاش"];

//  Payment by
export const vodafoneIfo: string =
  "برجاء ارسال قيمة الحجز على رقم (01012930010) مرفق معاه سكرين شوت للتحويل على واتساب لنفس الرقم";

export const testAB = {
  فاقوس: {
    "بنك مصر": ["05:30 ص", "07:30 ص"],
    "كوبرى الصحارة": ["06:10 ص", "08:10 ص"],
  },
  "أبو كبير": {
    "مزلقان المحلج": ["05:15 ص"],
  },
};

export const regionApi = {
  area,
  city,
  atime,
  PaymentSel,
  TypeOfTripSel,
  vodafoneIfo,
  testAB,
};
