// region.tsx

export type Place = {
  [key: string]: string[];
};

// city
export const city = [
  "فاقوس",
  "كفر صقر",
  "أبوكبير",
  "أبو حماد",
  "الحسينية",
  "الصالحية الجديدة",
  "كوبرى القصاصين"
];

//  area
export const area: Place = {
  فاقوس: ["بنك مصر", "كوبري الصحارة", "أبو شلبي"],
  "الصالحية الجديدة": ["الصالحية الجديدة"],
  "كفر صقر": ["كوبري السوق"],
  أبوكبير: ["مزلقان المحلج"],
  "أبو حماد": ["كوبرى المركز", "كوبري السعدية", "المعهد", "التل", "كوبرى القصاصين"],
  الحسينية: ["كوبرى الموقف"],
};

//  atimeing
export const atime: Place = {
  "بنك مصر": ["05:30 ص - المعاد الاول"],
  "كوبري الصحارة": ["06:10 ص - المعاد الاول"],
  "أبو شلبي": ["06:20 ص - المعاد الاول"],
  "الصالحية الجديدة": ["06:50 ص - المعاد الاول"],
  "كوبري السوق": ["05:00 ص - المعاد الاول"],
  "مزلقان المحلج": ["05:15 ص - المعاد الاول"],
  "كوبرى المركز": ["06:10 ص - المعاد الاول"],
  "كوبري السعدية": ["06:20 ص - المعاد الاول"],
  المعهد: ["06:30 ص - المعاد الاول"],
  التل: ["06:40 ص - المعاد الاول"],
  "كوبرى القصاصين": ["07:00 ص - المعاد الاول"],
  "كوبرى الموقف": ["05:45 ص - المعاد الاول"],
};

// Typa of Trip
export const TypeOfTripSel = ["ذهاب", "عودة", "ذهاب وعودة"];

// Payment Type
export const PaymentSel = ["نقداً", "فودافون كاش"];

//  Payment by
export const vodafoneIfo: string =
  "برجاء ارسال قيمة الحجز على رقم (01012930010) مرفق معاه سكرين شوت للتحويل على واتساب لنفس الرقم";

// End Time Edu

export const EndlecturesTime = ["02:00", "قبل كدة"];

export const regionApi = {
  area,
  city,
  atime,
  PaymentSel,
  TypeOfTripSel,
  vodafoneIfo,
  EndlecturesTime,
};
